Revit 2027 API
StairsType.LandingType Property
 The type for all landings in the stair element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LandingType { get; set; }
Public Property LandingType As ElementId
	Get
	Set
public:
property ElementId^ LandingType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LandingType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The specified landingTypeId is not a valid landing type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace